cf/Documents/ПриемТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПриемТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ОтгрузкаТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВнутренниеЗаказы</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
				<xr:Item>AccumulationRegister.СборкаЗаказа</xr:Item>
				<xr:Item>AccumulationRegister.ДвижениеТовара</xr:Item>
				<xr:Item>AccumulationRegister.ПотериТоваровВПути</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
				<xr:Item>AccumulationRegister.ИнтернетЗаказПокупателя</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВПути</xr:Item>
				<xr:Item>AccumulationRegister.ПриёмщикЗаказа</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезерве</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВСборке</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.ПеремещениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Маршруты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВозвратПеремещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправитьВСборку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеСписыватьЗаказы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакрытьЗаказ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоставитьВРезерв</Name>
					<Comment>Нужна, что бы ставить в резерв возращенные товары по внутренней заявке, и что бы не порушить прошлые проводки.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоВУпаковке</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Потеряно</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентАвтоматическойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРезерва</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сборщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приемщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Акция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Акция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПартии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Documents/ПриемТоваров/Ext/ManagerModule.bsl
Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Если НЕ ПроведенияДокументов.РазрешеноПерепроводитьДокумент(Ссылка) Тогда
		Возврат;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Ссылка.Процесс) Тогда
		Заказ = БизнесПроцессы.ПеремещениеТоваров.ПолучитьЗаказ(Ссылка.Процесс);
		ЭтоВнутреннийЗаказ = ТипЗнч(Заказ) = Тип("ДокументСсылка.ВнутреннийЗаказ");
		Если ЗначениеЗаполнено(Заказ) Тогда
			КонечныйСклад = ?(ЭтоВнутреннийЗаказ, Заказ.Заказчик, Заказ.Склад);
		Иначе
			КонечныйСклад = Справочники.Склады.ПустаяСсылка();
		КонецЕсли;	
	Иначе
		Заказ = Документы.ЗаказПокупателя.ПустаяСсылка();
		ЭтоВнутреннийЗаказ = Ложь;
		КонечныйСклад = Справочники.Склады.ПустаяСсылка();
	КонецЕсли;
	
	ПолучитьТаблицуПоРезервам = 
			Не Ссылка.Процесс.Пустая() И
			ЗначениеЗаполнено(Заказ);
			
			
	ИменаРегистров = Новый Массив;
	ПоВсем=Ложь;
	Если Не ДополнительныеСвойства.Свойство("ИменаРегистров",ИменаРегистров) Тогда
		ПоВсем=Истина;
		ИменаРегистров = Новый Массив;
	КонецЕсли;	
			
			
	
	ТекстЗапроса=КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() +Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		
	"ВЫБРАТЬ
	|	СкладОтправитель, СкладПолучатель
	|ИЗ
	|	Документ.ПриемТоваров
	|ГДЕ
	|	Ссылка = &Ссылка
	|;
	
	|//>>> Таблица документа
	
	|ВЫБРАТЬ
	|	Номенклатура	            КАК Номенклатура,
	|	Упаковка		            КАК Упаковка,
	|	Цена						КАК Цена,
	|	Акция						КАК Акция,
	|	СтавкаНДС					КАК СтавкаНДС,
	|	ПроцентРучнойСкидки			КАК ПроцентРучнойСкидки,
	|	ПроцентАвтоматическойСкидки,
	|	СУММА(Сумма)				КАК Сумма,
	|	СУММА(Количество)			КАК Количество,
	|   СУММА(КоличествоВУпаковке)	КАК КоличествоВУпаковке
	|ПОМЕСТИТЬ
	|	ТаблицаТовара
	|ИЗ
	|	Документ.ПриемТоваров.Товары
	|
	|ГДЕ
	|	Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура,
	|	Упаковка,
	|	Цена,
	|	Акция,
	|	СтавкаНДС,
	|	ПроцентРучнойСкидки,
	|	ПроцентАвтоматическойСкидки";
	
	
	
	Нтаб=Новый Структура;
	ТекНомер=2;	
		
	Если ИменаРегистров.Найти("ТоварыНаСкладах")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ТоварыНаСкладах",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
	
	
		"//>>> ТоварыНаСкладах
		
		|ВЫБРАТЬ
		|	&Период					КАК Период,
		|	&ВидДвиженияПриход		КАК ВидДвижения,
		|	&СкладПолучатель 		КАК Склад,
		|	Номенклатура	        КАК Номенклатура,
		|	ВЫБОР КОГДА Упаковка = &ПустаяУпаковка ТОГДА
		|		СУММА(Количество)
		|	ИНАЧЕ
		|		СУММА(Количество*Упаковка.Коэффициент)
		|	КОНЕЦ					КАК Количество
		|ИЗ
		|	Документ.ПриемТоваров.Товары
		|ГДЕ
		|	Ссылка = &Ссылка
		|	И (НЕ Ссылка.СкладПолучатель.Ячеестый ИЛИ НЕ Ячейка.ЭтоЗонаПриемки)
		|
		|СГРУППИРОВАТЬ ПО
		|	Номенклатура,
		|	Упаковка"
		
	КонецЕсли;
	
	
	Если ИменаРегистров.Найти("ТоварыВПути")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ТоварыВПути",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		"//>>> ТоварыВПути
		
		|ВЫБРАТЬ
		|	&Период						КАК Период,
		|	&ВидДвиженияРасход			КАК ВидДвижения,
		|	Ссылка.Процесс.Заказчик 	КАК Заказчик,
		|	ВЫБОР КОГДА Ссылка.ЭтоВозвратПеремещения ТОГДА Ссылка.СкладПолучатель ИНАЧЕ Ссылка.СкладОтправитель КОНЕЦ КАК СкладОтправитель,
		|	ВЫБОР КОГДА Ссылка.ЭтоВозвратПеремещения ТОГДА Ссылка.СкладОтправитель ИНАЧЕ Ссылка.СкладПолучатель КОНЕЦ КАК СкладПолучатель,
		|	Ссылка.Маршрут				КАК Маршрут,
		|	Номенклатура	            КАК Номенклатура,
		|	Упаковка					КАК Упаковка,
		|	СУММА(Количество+Потеряно) КАК Количество
		|ИЗ
		|	Документ.ПриемТоваров.Товары
		|
		|ГДЕ
		|	Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	Ссылка.Процесс.Заказчик,
		|	ВЫБОР КОГДА Ссылка.ЭтоВозвратПеремещения ТОГДА Ссылка.СкладПолучатель ИНАЧЕ Ссылка.СкладОтправитель КОНЕЦ,
		|	ВЫБОР КОГДА Ссылка.ЭтоВозвратПеремещения ТОГДА Ссылка.СкладОтправитель ИНАЧЕ Ссылка.СкладПолучатель КОНЕЦ,
		|	Ссылка.Маршрут,	
		|	Номенклатура, Упаковка"
	КонецЕсли;	
	
	
	Если ИменаРегистров.Найти("ПотериТоваровВПути")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ПотериТоваровВПути",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		"//>>> ПотериТоваровВПути
		
		|ВЫБРАТЬ
		|	&Период							КАК Период,
		|	&ВидДвиженияПриход				КАК ВидДвижения,
		|	Ссылка.Процесс.Заказчик.Заказ 	КАК Заказ,
		|	Ссылка.СкладОтправитель 		КАК СкладОтправитель,
		|	Ссылка.СкладПолучатель 			КАК СкладПолучатель,
		|	Номенклатура	           		КАК Номенклатура,
		|	Потеряно КАК Количество
		|ИЗ
		|	Документ.ПриемТоваров.Товары
		|
		|ГДЕ
		|	Ссылка = &Ссылка И Потеряно > 0
		|"
	КонецЕсли;	
	
	Если ИменаРегистров.Найти("ТоварыВЯчейках")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ТоварыВЯчейках",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		"//>>> ТоварыВЯчейках
		
		|ВЫБРАТЬ
		|	&Период						КАК Период,
		|	&ВидДвиженияПриход			КАК ВидДвижения,
		|	Ячейка						КАК Ячейка,
		|	Номенклатура	            КАК Номенклатура,
		|	ВЫБОР КОГДА Упаковка = &ПустаяУпаковка ТОГДА
		|		СУММА(Количество)
		|	ИНАЧЕ
		|		СУММА(Количество*Упаковка.Коэффициент)
		|	КОНЕЦ				КАК Количество
		|ИЗ
		|	Документ.ПриемТоваров.Товары
		|
		|ГДЕ
		|	Ссылка = &Ссылка И
		|	Ячейка <> &ПустаяЯчейка
		|
		|СГРУППИРОВАТЬ ПО
		|	Ячейка,
		|	Номенклатура,
		|	Упаковка"
	КонецЕсли;	
	
	
	Если ИменаРегистров.Найти("ТоварыВРезерве")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ТоварыВРезерве",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		"//>>> ТоварыВРезерве
		
		|ВЫБРАТЬ
		|	&Период						КАК Период,
		|	&ВидДвиженияПриход			КАК ВидДвижения,
		|	&СкладПолучатель			КАК Размещение,
		|	&Заказ						КАК ДокументРезерва,
		|	Номенклатура	            КАК Номенклатура,
		|	Количество					КАК Количество
		|ИЗ
		|	ТаблицаТовара
		|
		|ГДЕ
		|	НЕ (&ЭтоВнутреннийЗаказ и &СкладПолучатель = &КонечныйСклад)"
	КонецЕсли;	
	
	
	Если ИменаРегистров.Найти("ВнутренниеЗаказы")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ВнутренниеЗаказы",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		"//>>> ВнутренниеЗаказы
		
		|ВЫБРАТЬ
		|	&Период						КАК Период,
		|	&ВидДвиженияРасход			КАК ВидДвижения,
		|	&КонечныйСклад				КАК Заказчик,
		|	&Заказ						КАК ВнутреннийЗаказ,
		|	Тов.Номенклатура	        КАК Номенклатура,
		|	Тов.Упаковка		        КАК Упаковка,
		|	&СкладОтправитель			КАК Размещение,
		|	Тов.Количество				КАК Количество
		|ИЗ
		|	ТаблицаТовара Тов
		|ГДЕ &ЭтоВнутреннийЗаказ и &СкладПолучатель = &КонечныйСклад"
	КонецЕсли;	
	
	
	
	//Если ИменаРегистров.Найти("ТоварыВСборке")<>Неопределено ИЛИ ПоВсем Тогда
	//	ТекНомер=ТекНомер+1;
	//	Нтаб.Вставить("ТоварыВСборке",ТекНомер);
	//	
	//	ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
	//	"//>>> ТоварыВСборке
	//	
	//	|ВЫБРАТЬ
	//	|	&Период					Период,
	//	|	&ВидДвиженияПриход		ВидДвижения,
	//	|	Ссылка.СкладПолучатель 	Склад,
	//	|	&Заказ					Заказ,
	//	|	Номенклатура			Номенклатура,
	//	|	Упаковка				Упаковка,
	//	|	Количество				Собрано
	//	|ИЗ
	//	|	Документ.ПриемТоваров.Товары
	//	|
	//	|ГДЕ
	//	|	Ссылка = &Ссылка"
	//КонецЕсли;	
	
	
	
	Если ИменаРегистров.Найти("ПриёмщикЗаказа")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ПриёмщикЗаказа",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		"//>>> ПриёмщикЗаказа
		
		|ВЫБРАТЬ
		|	&Период						КАК Период,
		|	Сборщик						КАК Приёмщик,
		|	&Заказ						КАК Заказ,
		|	Номенклатура				КАК Номенклатура,
		|	Упаковка					КАК Упаковка,
		|	Ссылка.СкладПолучатель		КАК Склад,
		|  	Ячейка						КАК Ячейка,		
		|	КОЛИЧЕСТВО(Номенклатура)	КАК Количество
		|ИЗ
		|	Документ.ПриемТоваров.Товары
		|
		|ГДЕ
		|	Ссылка = &Ссылка И
		|	НЕ Ссылка.ЭтоВозвратПеремещения
		|
		|СГРУППИРОВАТЬ ПО
		|	Ссылка,
		|	Сборщик,
		|	Номенклатура,
		|	Упаковка,
		|	Ячейка"
	КонецЕсли;	
	
	
	
	Если ИменаРегистров.Найти("ДвижениеТовара")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ДвижениеТовара",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		"//>>> ДвижениеТовара
		
		|ВЫБРАТЬ
		|	&Период							Период,
		|	&СкладПолучатель 				Склад,
		|	Ссылка.Процесс.Заказчик.Заказ 	Заказ,
		|	Номенклатура,
		|	Упаковка,
		|	СУММА(Количество) Количество
		|ИЗ
		|	Документ.ПриемТоваров.Товары
		|ГДЕ
		|	Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	Ссылка,
		|	Номенклатура,
		|	Упаковка"
	КонецЕсли;	
	
	
	Если ИменаРегистров.Найти("СборкаЗаказа")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("СборкаЗаказа",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		
		"//>>> СборкаЗаказа
		|выбрать неопределено где истина=ложь"
		
	КонецЕсли;	
	
	
	Запрос=Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("Заказ", 				Заказ);
	Запрос.УстановитьПараметр("Процесс", 			Ссылка.Процесс);
	Запрос.УстановитьПараметр("Период", 			Ссылка.Дата);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", 	ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ВидДвиженияРасход", 	ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("ПустойСборщик", 		Справочники.ФизическиеЛица.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяЯчейка", 		Справочники.Ячейки.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойСклад", 		Справочники.Склады.ПустаяСсылка());
	Запрос.УстановитьПараметр("СкладОтправитель", 	Ссылка.СкладОтправитель);
	Запрос.УстановитьПараметр("СкладПолучатель", 	Ссылка.СкладПолучатель);
	Запрос.УстановитьПараметр("КонечныйСклад",	 	КонечныйСклад);
	Запрос.УстановитьПараметр("ПолучитьТаблицуПоРезервам", 	ПолучитьТаблицуПоРезервам);
	Запрос.УстановитьПараметр("ПустаяУпаковка", 		Справочники.УпаковкиНоменклатуры.ПустаяСсылка());
	
	Запрос.УстановитьПараметр("ЭтоИнтернетЗаказ", 		ТипЗнч(Заказ) = Тип("ДокументСсылка.ИнтернетЗаказПокупателя"));
	Запрос.УстановитьПараметр("ЭтоЗаказПокупателя", 	ТипЗнч(Заказ) = Тип("ДокументСсылка.ЗаказПокупателя"));
	Запрос.УстановитьПараметр("ЭтоВнутреннийЗаказ", 	ЭтоВнутреннийЗаказ);
	Запрос.УстановитьПараметр("ЭтоВозвратПеремещения", 	Ссылка.ЭтоВозвратПеремещения);
	
	Запрос.Текст=ТекстЗапроса;
	Пакет = Запрос.ВыполнитьПакет();
	
	Для Каждого Элем Из Нтаб Цикл
		ДополнительныеСвойства.Вставить(Элем.Ключ,Пакет[Элем.Значение].Выгрузить());
	КонецЦикла;	
	
	
	//ДополнительныеСвойства.Вставить("ПараметрыСистемы", КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить()));
	//ДополнительныеСвойства.Вставить("Шапка", 			КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[1].Выгрузить()));
	//ДополнительныеСвойства.Вставить("ТоварыНаСкладах", 			Пакет[3].Выгрузить());
	//ДополнительныеСвойства.Вставить("ТоварыВПути", 				Пакет[4].Выгрузить());
	//ДополнительныеСвойства.Вставить("ТоварыВЯчейках", 			Пакет[5].Выгрузить());
	//
	//ДополнительныеСвойства.Вставить("ТоварыВРезерве", 			Пакет[6].Выгрузить());
	//
	//ДополнительныеСвойства.Вставить("СборкаЗаказа",		 		Пакет[10].Выгрузить());    //древний регистр
	//
	//ДополнительныеСвойства.Вставить("ТоварыВСборке",		 		Пакет[11].Выгрузить());
	//	
	//
	//ДополнительныеСвойства.Вставить("ПриёмщикЗаказа", 			Пакет[12].Выгрузить());
	//ДополнительныеСвойства.Вставить("ДвижениеТовара", 			Пакет[13].Выгрузить());
	////ДополнительныеСвойства.Вставить("ПартииТоваров", 			Пакет[14].Выгрузить());

	//Если Не Заказ.СпособРазмещенияБезЗаказа И Не Ссылка.НеСписыватьЗаказы Тогда
	//	ДополнительныеСвойства.Вставить("ЗаказыПокупателей", 		Пакет[7].Выгрузить());
	//	ДополнительныеСвойства.Вставить("ИнтернетЗаказПокупателя", 	Пакет[8].Выгрузить());
	//	ДополнительныеСвойства.Вставить("ВнутренниеЗаказы",		 	Пакет[9].Выгрузить());
	//КонецЕсли;
	
	
КонецПроцедуры
